zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_ISR1_OFFSET                     (0x1C)                                        /**<  (PWM_ISR1) PWM Interrupt Status Register 1  Offset */

#define PWM_ISR1_CHID0_Pos                  0                                              /**< (PWM_ISR1) Counter Event on Channel 0 Position */
#define PWM_ISR1_CHID0_Msk                  (_U_(0x1) << PWM_ISR1_CHID0_Pos)               /**< (PWM_ISR1) Counter Event on Channel 0 Mask */
#define PWM_ISR1_CHID0                      PWM_ISR1_CHID0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR1_CHID0_Msk instead */
#define PWM_ISR1_CHID1_Pos                  1                                              /**< (PWM_ISR1) Counter Event on Channel 1 Position */
#define PWM_ISR1_CHID1_Msk                  (_U_(0x1) << PWM_ISR1_CHID1_Pos)               /**< (PWM_ISR1) Counter Event on Channel 1 Mask */
#define PWM_ISR1_CHID1                      PWM_ISR1_CHID1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR1_CHID1_Msk instead */
#define PWM_ISR1_CHID2_Pos                  2                                              /**< (PWM_ISR1) Counter Event on Channel 2 Position */
#define PWM_ISR1_CHID2_Msk                  (_U_(0x1) << PWM_ISR1_CHID2_Pos)               /**< (PWM_ISR1) Counter Event on Channel 2 Mask */
#define PWM_ISR1_CHID2                      PWM_ISR1_CHID2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR1_CHID2_Msk instead */
#define PWM_ISR1_CHID3_Pos                  3                                              /**< (PWM_ISR1) Counter Event on Channel 3 Position */
#define PWM_ISR1_CHID3_Msk                  (_U_(0x1) << PWM_ISR1_CHID3_Pos)               /**< (PWM_ISR1) Counter Event on Channel 3 Mask */
#define PWM_ISR1_CHID3                      PWM_ISR1_CHID3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR1_CHID3_Msk instead */
#define PWM_ISR1_FCHID0_Pos                 16                                             /**< (PWM_ISR1) Fault Protection Trigger on Channel 0 Position */
#define PWM_ISR1_FCHID0_Msk                 (_U_(0x1) << PWM_ISR1_FCHID0_Pos)              /**< (PWM_ISR1) Fault Protection Trigger on Channel 0 Mask */
#define PWM_ISR1_FCHID0                     PWM_ISR1_FCHID0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR1_FCHID0_Msk instead */
#define PWM_ISR1_FCHID1_Pos                 17                                             /**< (PWM_ISR1) Fault Protection Trigger on Channel 1 Position */
#define PWM_ISR1_FCHID1_Msk                 (_U_(0x1) << PWM_ISR1_FCHID1_Pos)              /**< (PWM_ISR1) Fault Protection Trigger on Channel 1 Mask */
#define PWM_ISR1_FCHID1                     PWM_ISR1_FCHID1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR1_FCHID1_Msk instead */
#define PWM_ISR1_FCHID2_Pos                 18                                             /**< (PWM_ISR1) Fault Protection Trigger on Channel 2 Position */
#define PWM_ISR1_FCHID2_Msk                 (_U_(0x1) << PWM_ISR1_FCHID2_Pos)              /**< (PWM_ISR1) Fault Protection Trigger on Channel 2 Mask */
#define PWM_ISR1_FCHID2                     PWM_ISR1_FCHID2_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR1_FCHID2_Msk instead */
#define PWM_ISR1_FCHID3_Pos                 19                                             /**< (PWM_ISR1) Fault Protection Trigger on Channel 3 Position */
#define PWM_ISR1_FCHID3_Msk                 (_U_(0x1) << PWM_ISR1_FCHID3_Pos)              /**< (PWM_ISR1) Fault Protection Trigger on Channel 3 Mask */
#define PWM_ISR1_FCHID3                     PWM_ISR1_FCHID3_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR1_FCHID3_Msk instead */
#define PWM_ISR1_MASK                       _U_(0xF000F)                                   /**< \deprecated (PWM_ISR1) Register MASK  (Use PWM_ISR1_Msk instead)  */
#define PWM_ISR1_Msk                        _U_(0xF000F)                                   /**< (PWM_ISR1) Register Mask  */

#define PWM_ISR1_CHID_Pos                   0                                              /**< (PWM_ISR1 Position) Counter Event on Channel x */
#define PWM_ISR1_CHID_Msk                   (_U_(0xF) << PWM_ISR1_CHID_Pos)                /**< (PWM_ISR1 Mask) CHID */
#define PWM_ISR1_CHID(value)                (PWM_ISR1_CHID_Msk & ((value) << PWM_ISR1_CHID_Pos))  
#define PWM_ISR1_FCHID_Pos                  16                                             /**< (PWM_ISR1 Position) Fault Protection Trigger on Channel 3 */
#define PWM_ISR1_FCHID_Msk                  (_U_(0xF) << PWM_ISR1_FCHID_Pos)               /**< (PWM_ISR1 Mask) FCHID */
#define PWM_ISR1_FCHID(value)               (PWM_ISR1_FCHID_Msk & ((value) << PWM_ISR1_FCHID_Pos))  

/* -------- PWM_SCM : (PWM Offset: 0x20) (R/W 32) PWM Sync Channels Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SYNC0:1;                   /**< bit:      0  Synchronous Channel 0                    */
    uint32_t SYNC1:1;                   /**< bit:      1  Synchronous Channel 1                    */
    uint32_t SYNC2:1;                   /**< bit:      2  Synchronous Channel 2                    */
    uint32_t SYNC3:1;                   /**< bit:      3  Synchronous Channel 3                    */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t UPDM:2;                    /**< bit: 16..17  Synchronous Channels Update Mode         */
    uint32_t :2;                        /**< bit: 18..19  Reserved */
    uint32_t PTRM:1;                    /**< bit:     20  DMA Controller Transfer Request Mode     */
    uint32_t PTRCS:3;                   /**< bit: 21..23  DMA Controller Transfer Request Comparison Selection */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t SYNC:4;                    /**< bit:   0..3  Synchronous Channel x                    */
    uint32_t :28;                       /**< bit:  4..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_SCM_Type;
