zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/pwm.h
/* -------- PWM_SSPR : (PWM Offset: 0xa0) (R/W 32) PWM Spread Spectrum Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SPRD:24;                   /**< bit:  0..23  Spread Spectrum Limit Value              */
    uint32_t SPRDM:1;                   /**< bit:     24  Spread Spectrum Counter Mode             */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_SSPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_SSPR_OFFSET                     (0xA0)                                        /**<  (PWM_SSPR) PWM Spread Spectrum Register  Offset */

#define PWM_SSPR_SPRD_Pos                   0                                              /**< (PWM_SSPR) Spread Spectrum Limit Value Position */
#define PWM_SSPR_SPRD_Msk                   (_U_(0xFFFFFF) << PWM_SSPR_SPRD_Pos)           /**< (PWM_SSPR) Spread Spectrum Limit Value Mask */
#define PWM_SSPR_SPRD(value)                (PWM_SSPR_SPRD_Msk & ((value) << PWM_SSPR_SPRD_Pos))
#define PWM_SSPR_SPRDM_Pos                  24                                             /**< (PWM_SSPR) Spread Spectrum Counter Mode Position */
#define PWM_SSPR_SPRDM_Msk                  (_U_(0x1) << PWM_SSPR_SPRDM_Pos)               /**< (PWM_SSPR) Spread Spectrum Counter Mode Mask */
#define PWM_SSPR_SPRDM                      PWM_SSPR_SPRDM_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SSPR_SPRDM_Msk instead */
#define PWM_SSPR_MASK                       _U_(0x1FFFFFF)                                 /**< \deprecated (PWM_SSPR) Register MASK  (Use PWM_SSPR_Msk instead)  */
#define PWM_SSPR_Msk                        _U_(0x1FFFFFF)                                 /**< (PWM_SSPR) Register Mask  */


/* -------- PWM_SSPUP : (PWM Offset: 0xa4) (/W 32) PWM Spread Spectrum Update Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SPRDUP:24;                 /**< bit:  0..23  Spread Spectrum Limit Value Update       */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_SSPUP_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_SSPUP_OFFSET                    (0xA4)                                        /**<  (PWM_SSPUP) PWM Spread Spectrum Update Register  Offset */

#define PWM_SSPUP_SPRDUP_Pos                0                                              /**< (PWM_SSPUP) Spread Spectrum Limit Value Update Position */
#define PWM_SSPUP_SPRDUP_Msk                (_U_(0xFFFFFF) << PWM_SSPUP_SPRDUP_Pos)        /**< (PWM_SSPUP) Spread Spectrum Limit Value Update Mask */
#define PWM_SSPUP_SPRDUP(value)             (PWM_SSPUP_SPRDUP_Msk & ((value) << PWM_SSPUP_SPRDUP_Pos))
#define PWM_SSPUP_MASK                      _U_(0xFFFFFF)                                  /**< \deprecated (PWM_SSPUP) Register MASK  (Use PWM_SSPUP_Msk instead)  */
#define PWM_SSPUP_Msk                       _U_(0xFFFFFF)                                  /**< (PWM_SSPUP) Register Mask  */


/* -------- PWM_SMMR : (PWM Offset: 0xb0) (R/W 32) PWM Stepper Motor Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t GCEN0:1;                   /**< bit:      0  Gray Count ENable                        */
    uint32_t GCEN1:1;                   /**< bit:      1  Gray Count ENable                        */
    uint32_t :14;                       /**< bit:  2..15  Reserved */
    uint32_t DOWN0:1;                   /**< bit:     16  DOWN Count                               */
    uint32_t DOWN1:1;                   /**< bit:     17  DOWN Count                               */
    uint32_t :14;                       /**< bit: 18..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t GCEN:2;                    /**< bit:   0..1  Gray Count ENable                        */
    uint32_t :14;                       /**< bit:  2..15  Reserved */
    uint32_t DOWN:2;                    /**< bit: 16..17  DOWN Count                               */
    uint32_t :14;                       /**< bit: 18..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_SMMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_SMMR_OFFSET                     (0xB0)                                        /**<  (PWM_SMMR) PWM Stepper Motor Mode Register  Offset */

#define PWM_SMMR_GCEN0_Pos                  0                                              /**< (PWM_SMMR) Gray Count ENable Position */
#define PWM_SMMR_GCEN0_Msk                  (_U_(0x1) << PWM_SMMR_GCEN0_Pos)               /**< (PWM_SMMR) Gray Count ENable Mask */
#define PWM_SMMR_GCEN0                      PWM_SMMR_GCEN0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SMMR_GCEN0_Msk instead */
#define PWM_SMMR_GCEN1_Pos                  1                                              /**< (PWM_SMMR) Gray Count ENable Position */
#define PWM_SMMR_GCEN1_Msk                  (_U_(0x1) << PWM_SMMR_GCEN1_Pos)               /**< (PWM_SMMR) Gray Count ENable Mask */
#define PWM_SMMR_GCEN1                      PWM_SMMR_GCEN1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SMMR_GCEN1_Msk instead */
#define PWM_SMMR_DOWN0_Pos                  16                                             /**< (PWM_SMMR) DOWN Count Position */
#define PWM_SMMR_DOWN0_Msk                  (_U_(0x1) << PWM_SMMR_DOWN0_Pos)               /**< (PWM_SMMR) DOWN Count Mask */
#define PWM_SMMR_DOWN0                      PWM_SMMR_DOWN0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SMMR_DOWN0_Msk instead */
#define PWM_SMMR_DOWN1_Pos                  17                                             /**< (PWM_SMMR) DOWN Count Position */
#define PWM_SMMR_DOWN1_Msk                  (_U_(0x1) << PWM_SMMR_DOWN1_Pos)               /**< (PWM_SMMR) DOWN Count Mask */
#define PWM_SMMR_DOWN1                      PWM_SMMR_DOWN1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SMMR_DOWN1_Msk instead */
#define PWM_SMMR_MASK                       _U_(0x30003)                                   /**< \deprecated (PWM_SMMR) Register MASK  (Use PWM_SMMR_Msk instead)  */
#define PWM_SMMR_Msk                        _U_(0x30003)                                   /**< (PWM_SMMR) Register Mask  */

#define PWM_SMMR_GCEN_Pos                   0                                              /**< (PWM_SMMR Position) Gray Count ENable */
#define PWM_SMMR_GCEN_Msk                   (_U_(0x3) << PWM_SMMR_GCEN_Pos)                /**< (PWM_SMMR Mask) GCEN */
#define PWM_SMMR_GCEN(value)                (PWM_SMMR_GCEN_Msk & ((value) << PWM_SMMR_GCEN_Pos))  
#define PWM_SMMR_DOWN_Pos                   16                                             /**< (PWM_SMMR Position) DOWN Count */
#define PWM_SMMR_DOWN_Msk                   (_U_(0x3) << PWM_SMMR_DOWN_Pos)                /**< (PWM_SMMR Mask) DOWN */
#define PWM_SMMR_DOWN(value)                (PWM_SMMR_DOWN_Msk & ((value) << PWM_SMMR_DOWN_Pos))  

